app/controllers/api/v1/orders_controller.rb

  def waiter_call_action
    client = Client.find_by(authentication_token: waiter_call_params[:authentication_token])
    if !client.present? || client == nil
      render json: {error: true, message: "Account not authorized, please login again." }, :status => 200
    else
      waiter_call = WaiterCall.create(table_id: waiter_call_params[:table_id], client_id: client.id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."authentication_token" = $1 LIMIT $2  [["authentication_token", "GIHIysouPRBX0RhnCJSHW6RZ+XWhtH29ZIkN2HG+OAviFRbKJMhpd2xYVAHsHtoftFS0EomvKevGw47rrWofgw=="], ["LIMIT", 1]]
INSERT INTO "waiter_calls" ("table_id", "created_at", "updated_at", "client_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["table_id", 1], ["created_at", "2017-09-06 18:22:17.809567"], ["updated_at", "2017-09-06 18:22:17.809567"], ["client_id", 1]]