app/controllers/restaurant_managers/dashboard_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."restaurant_id" = $1  [["restaurant_id", 1]]
SELECT "tables".* FROM "tables" WHERE "tables"."restaurant_id" = $1  [["restaurant_id", 1]]
SELECT "waiter_calls".* FROM "waiter_calls" WHERE "waiter_calls"."table_id" = 1 AND "waiter_calls"."complete" = $1  [["complete", "f"]]
---
	def index
		all_orders = current_restaurant_manager.restaurant.orders

		@in_queue = all_orders.select do |hash|
			hash.preparing_at.nil?
		end

		@preparing = all_orders.select do |hash|
			!hash.preparing_at.nil? && hash.served_at.nil?
		end

		@serving = all_orders.select do |hash|
			!hash.served_at.nil? && hash.checked_out_at.nil?
		end

		table_ids = current_restaurant_manager.restaurant.tables.map{|table| table.id }
		@waiter_calls = WaiterCall.where(table_id: table_ids, complete: false)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "waiter_calls".* FROM "waiter_calls" WHERE "waiter_calls"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "waiter_calls" SET "complete" = $1, "updated_at" = $2 WHERE "waiter_calls"."id" = $3  [["complete", "t"], ["updated_at", "2017-09-06 18:24:37.909156"], ["id", 3]]
---
	def receive_waiter_call

		if WaiterCall.find(params[:waiter_call_id]).table.restaurant.id === current_restaurant_manager.restaurant.id



			waiter_call = WaiterCall.find(params[:waiter_call_id])



			waiter_call.complete = true
			waiter_call.save!