app/controllers/restaurant_owners/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "address", "contact", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "restaurant_owner_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
	def create
		@restaurant = current_restaurant_owner.restaurants.build(restaurant_params)
		if @restaurant.save

SELECT  "restaurant_owners".* FROM "restaurant_owners" WHERE "restaurant_owners"."id" = $1 ORDER BY "restaurant_owners"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."restaurant_owner_id" = $1  [["restaurant_owner_id", 1]]
---
	def set_restaurant
		if Restaurant.find(params[:id]).restaurant_owner.id == current_restaurant_owner.id